#include<iostream>
#include<cstdio>
#define MAXN 1000042
using namespace std;

int n;
long long flask[MAXN], k;

int main (){
    cin >> n >> k;

    // Инициализация; В масивът flask се пазят колко литра побира i-тата колба;
    // Номерацията започва от 1;

    flask[1] = 0;
    for (int i=2; i<=n; i++){
        flask[i] = flask[i-1] + i-1;
    }

    // Проверяваме коя е най-малката колба, която може да използваме;

    for (int i=1; i<=n; i+=2){    // Така се минава през следните индекси - 1, 3, 5... тоест пропускат се четните
        if (flask[i] >= k){       // Разбира се, пренебрегването на четните колби може да стане и чрез директна проверва
            cout << i << "\n";    // в if ([i]%2==0) continue;

            break;                // След като редицата е нарастваща, веднъж намерели ли сме колба,
                                  // няма смисъл да продължаваме да преглеждаме останалите колби
        }
    }
    return 0;
}
